# ConstantHeightNotParallelError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ConstantHeightNotParallelError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Constant-height-defining lines must be parallel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConstantHeightNotParallelError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConstantHeightNotParallelError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConstantHeightNotParallelError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace